ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/am243x/GPIO1.xml
<module name="GPIO1" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="MEM_pid" acronym="MEM_pid" offset="0x0" width="32" description="GPIO Periperal ID Register">
		<bitfield id="SCHEME" width="2" begin="31" end="30" resetval="0x1" description="Current scheme" range="31 - 30" rwaccess="R"/> 
		<bitfield id="FUNC" width="12" begin="27" end="16" resetval="0x1155" description="Function code assigned to TCP3" range="27 - 16" rwaccess="R"/> 
		<bitfield id="RTL" width="5" begin="15" end="11" resetval="0x5" description="RTL Version R code" range="15 - 11" rwaccess="R"/> 
		<bitfield id="MAJOR" width="3" begin="10" end="8" resetval="0x1" description="Major revision X code" range="10 - 8" rwaccess="R"/> 
		<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Custom version code" range="7 - 6" rwaccess="R"/> 
		<bitfield id="MINOR" width="6" begin="5" end="0" resetval="0x5" description="Minor revision Y code" range="5 - 0" rwaccess="R"/>
	</register>
	<register id="MEM_PCR" acronym="MEM_PCR" offset="0x4" width="32" description="Peripheral Control Register">
		<bitfield id="SOFT" width="1" begin="1" end="1" resetval="0x0" description="Used in conjunction with FREE bit to determine the emulation suspend mode" range="1" rwaccess="R"/> 
		<bitfield id="FREE" width="1" begin="0" end="0" resetval="0x1" description="For GPIO, the FREE bit is fixed at 1, which means GPIO runs free in emulation suspend" range="0" rwaccess="R"/>
	</register>
	<register id="MEM_BINTEN" acronym="MEM_BINTEN" offset="0x8" width="32" description="Bit Interrupt Enable Register">
		<bitfield id="EN" width="16" begin="15" end="0" resetval="0x0" description="Per bank interrupt enable 0 = disable, 1 = enable" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="MEM_DIR01" acronym="MEM_DIR01" offset="0x10" width="32" description="Direction Register">
		<bitfield id="DIR1" width="16" begin="31" end="16" resetval="0x65535" description="Direction of GPIO bank 1 bits, 0 = output, 1 = input" range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="DIR0" width="16" begin="15" end="0" resetval="0x65535" description="Direction of GPIO bank 0 bits, 0 = output, 1 = input" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="MEM_OUT_DATA01" acronym="MEM_OUT_DATA01" offset="0x14" width="32" description="Output Drive State Register">
		<bitfield id="OUT1" width="16" begin="31" end="16" resetval="0x0" description="Output drive state of GPIO bank 1 bits, does not affect operation when it is configured as input Reading it returns the output drive state" range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="OUT0" width="16" begin="15" end="0" resetval="0x0" description="Output drive state of GPIO bank 0 bits, does not affect operation when it is configured as input Reading it returns the output drive state" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="MEM_SET_DATA01" acronym="MEM_SET_DATA01" offset="0x18" width="32" description="Set Output Drive State Register">
		<bitfield id="SET1" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 sets the output drive state of GPIO bank 1 bits Reading it returns the output drive state" range="31 - 16" rwaccess="R/W1TS"/> 
		<bitfield id="SET0" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 sets the output drive state of GPIO bank 0 bits Reading it returns the output drive state" range="15 - 0" rwaccess="R/W1TS"/>
	</register>
	<register id="MEM_CLR_DATA01" acronym="MEM_CLR_DATA01" offset="0x1C" width="32" description="Clear Output Drive State Register">
		<bitfield id="CLR1" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 clears the output drive state of GPIO Reading it returns the output drive state" range="31 - 16" rwaccess="R/W1TC"/> 
		<bitfield id="CLR0" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 clears the output drive state of GPIO Reading it returns the output drive state" range="15 - 0" rwaccess="R/W1TC"/>
	</register>
	<register id="MEM_IN_DATA01" acronym="MEM_IN_DATA01" offset="0x20" width="32" description="Bank Status Register">
		<bitfield id="IN1" width="16" begin="31" end="16" resetval="0x0" description="Status of GPIO bank 1 bits" range="31 - 16" rwaccess="R"/> 
		<bitfield id="IN0" width="16" begin="15" end="0" resetval="0x0" description="Status of GPIO bank 0 bits" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="MEM_SET_RIS_TRIG01" acronym="MEM_SET_RIS_TRIG01" offset="0x24" width="32" description="Set Rising Edge Detection Register">
		<bitfield id="SETRIS1" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 enables rising edge detection for GPIO bank 1 bits" range="31 - 16" rwaccess="R/W1TS"/> 
		<bitfield id="SETRIS0" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 enables rising edge detection for GPIO bank 0 bits" range="15 - 0" rwaccess="R/W1TS"/>
	</register>
	<register id="MEM_CLR_RIS_TRIG01" acronym="MEM_CLR_RIS_TRIG01" offset="0x28" width="32" description="Clear Rising Edge Detection Register">
		<bitfield id="CLRRIS1" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 clears rising edge detection for GPIO bank 1 bits" range="31 - 16" rwaccess="R/W1TC"/> 
		<bitfield id="CLRRIS0" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 clears rising edge detection for GPIO bank 0 bits" range="15 - 0" rwaccess="R/W1TC"/>
	</register>
	<register id="MEM_SET_FAL_TRIG01" acronym="MEM_SET_FAL_TRIG01" offset="0x2C" width="32" description="Set Falling Edge Detection Register">
		<bitfield id="SETFAL1" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 enables falling edge detection for for GPIO bank 1 bits " range="31 - 16" rwaccess="R/W1TS"/> 
		<bitfield id="SETFAL0" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 enables falling edge detection for for GPIO bank 0 bits " range="15 - 0" rwaccess="R/W1TS"/>
	</register>
	<register id="MEM_CLR_FAL_TRIG01" acronym="MEM_CLR_FAL_TRIG01" offset="0x30" width="32" description="Clear Falling Edge Detection Register">
		<bitfield id="CLRFAL1" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 clears falling edge detection for for GPIO bank 1 bits " range="31 - 16" rwaccess="R/W1TC"/> 
		<bitfield id="CLRFAL0" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 clears falling edge detection for for GPIO bank 0 bits " range="15 - 0" rwaccess="R/W1TC"/>
	</register>
