ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/am243x/GPIO1.xml
	<register id="MEM_INTSTAT01" acronym="MEM_INTSTAT01" offset="0x34" width="32" description="Bank Interrupt Status Register">
		<bitfield id="STAT1" width="16" begin="31" end="16" resetval="0x0" description="Status of GPIO bank 0 bits interrupt Reading back 1 = interrupt occurred 0 = interrupt hasnt occurred since last cleared Writing 1 clears the corresponding interrupt status" range="31 - 16" rwaccess="R/W1TC"/> 
		<bitfield id="STAT0" width="16" begin="15" end="0" resetval="0x0" description="Status of GPIO bank 0 bits interrupt Reading back 1 = interrupt occurred 0 = interrupt hasnt occurred since last cleared Writing 1 clears the corresponding interrupt status" range="15 - 0" rwaccess="R/W1TC"/>
	</register>
	<register id="MEM_DIR23" acronym="MEM_DIR23" offset="0x38" width="32" description="Direction Register">
		<bitfield id="DIR3" width="16" begin="31" end="16" resetval="0x65535" description="Direction of GPIO bank 3 bits, 0 = output, 1 = input" range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="DIR2" width="16" begin="15" end="0" resetval="0x65535" description="Direction of GPIO bank 2 bits, 0 = output, 1 = input" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="MEM_OUT_DATA23" acronym="MEM_OUT_DATA23" offset="0x3C" width="32" description="Output Drive State Register">
		<bitfield id="OUT3" width="16" begin="31" end="16" resetval="0x0" description="Output drive state of GPIO bank 3 bits, does not affect operation when it is configured as input Reading it returns the output drive state" range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="OUT2" width="16" begin="15" end="0" resetval="0x0" description="Output drive state of GPIO bank 2 bits, does not affect operation when it is configured as input Reading it returns the output drive state" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="MEM_SET_DATA23" acronym="MEM_SET_DATA23" offset="0x40" width="32" description="Set Output Drive State Register">
		<bitfield id="SET3" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 sets the output drive state of GPIO bank 3 bits Reading it returns the output drive state" range="31 - 16" rwaccess="R/W1TS"/> 
		<bitfield id="SET2" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 sets the output drive state of GPIO bank 2 bits Reading it returns the output drive state" range="15 - 0" rwaccess="R/W1TS"/>
	</register>
	<register id="MEM_CLR_DATA23" acronym="MEM_CLR_DATA23" offset="0x44" width="32" description="Clear Output Drive State Register">
		<bitfield id="CLR3" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 clears the output drive state of GPIO Reading it returns the output drive state" range="31 - 16" rwaccess="R/W1TC"/> 
		<bitfield id="CLR2" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 clears the output drive state of GPIO Reading it returns the output drive state" range="15 - 0" rwaccess="R/W1TC"/>
	</register>
	<register id="MEM_IN_DATA23" acronym="MEM_IN_DATA23" offset="0x48" width="32" description="Bank Status Register">
		<bitfield id="IN3" width="16" begin="31" end="16" resetval="0x0" description="Status of GPIO bank 3 bits" range="31 - 16" rwaccess="R"/> 
		<bitfield id="IN2" width="16" begin="15" end="0" resetval="0x0" description="Status of GPIO bank 2 bits" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="MEM_SET_RIS_TRIG23" acronym="MEM_SET_RIS_TRIG23" offset="0x4C" width="32" description="Set Rising Edge Detection Register">
		<bitfield id="SETRIS3" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 enables rising edge detection for GPIO bank 3 bits" range="31 - 16" rwaccess="R/W1TS"/> 
		<bitfield id="SETRIS2" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 enables rising edge detection for GPIO bank 2 bits" range="15 - 0" rwaccess="R/W1TS"/>
	</register>
	<register id="MEM_CLR_RIS_TRIG23" acronym="MEM_CLR_RIS_TRIG23" offset="0x50" width="32" description="Clear Rising Edge Detection Register">
		<bitfield id="CLRRIS3" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 clears rising edge detection for GPIO bank 3 bits" range="31 - 16" rwaccess="R/W1TC"/> 
		<bitfield id="CLRRIS2" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 clears rising edge detection for GPIO bank 2 bits" range="15 - 0" rwaccess="R/W1TC"/>
	</register>
	<register id="MEM_SET_FAL_TRIG23" acronym="MEM_SET_FAL_TRIG23" offset="0x54" width="32" description="Set Falling Edge Detection Register">
		<bitfield id="SETFAL3" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 enables falling edge detection for for GPIO bank 3 bits " range="31 - 16" rwaccess="R/W1TS"/> 
		<bitfield id="SETFAL2" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 enables falling edge detection for for GPIO bank 2 bits " range="15 - 0" rwaccess="R/W1TS"/>
	</register>
	<register id="MEM_CLR_FAL_TRIG23" acronym="MEM_CLR_FAL_TRIG23" offset="0x58" width="32" description="Clear Falling Edge Detection Register">
		<bitfield id="CLRFAL3" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 clears falling edge detection for for GPIO bank 3 bits " range="31 - 16" rwaccess="R/W1TC"/> 
		<bitfield id="CLRFAL2" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 clears falling edge detection for for GPIO bank 2 bits " range="15 - 0" rwaccess="R/W1TC"/>
	</register>
	<register id="MEM_INTSTAT23" acronym="MEM_INTSTAT23" offset="0x5C" width="32" description="Bank Interrupt Status Register">
		<bitfield id="STAT3" width="16" begin="31" end="16" resetval="0x0" description="Status of GPIO bank 2 bits interrupt Reading back 1 = interrupt occurred 0 = interrupt hasnt occurred since last cleared Writing 1 clears the corresponding interrupt status" range="31 - 16" rwaccess="R/W1TC"/> 
		<bitfield id="STAT2" width="16" begin="15" end="0" resetval="0x0" description="Status of GPIO bank 2 bits interrupt Reading back 1 = interrupt occurred 0 = interrupt hasnt occurred since last cleared Writing 1 clears the corresponding interrupt status" range="15 - 0" rwaccess="R/W1TC"/>
	</register>
	<register id="MEM_DIR45" acronym="MEM_DIR45" offset="0x60" width="32" description="Direction Register">
		<bitfield id="DIR5" width="16" begin="31" end="16" resetval="0x65535" description="Direction of GPIO bank 5 bits, 0 = output, 1 = input" range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="DIR4" width="16" begin="15" end="0" resetval="0x65535" description="Direction of GPIO bank 4 bits, 0 = output, 1 = input" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="MEM_OUT_DATA45" acronym="MEM_OUT_DATA45" offset="0x64" width="32" description="Output Drive State Register">
		<bitfield id="OUT5" width="16" begin="31" end="16" resetval="0x0" description="Output drive state of GPIO bank 5 bits, does not affect operation when it is configured as input Reading it returns the output drive state" range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="OUT4" width="16" begin="15" end="0" resetval="0x0" description="Output drive state of GPIO bank 4 bits, does not affect operation when it is configured as input Reading it returns the output drive state" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="MEM_SET_DATA45" acronym="MEM_SET_DATA45" offset="0x68" width="32" description="Set Output Drive State Register">
		<bitfield id="SET5" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 sets the output drive state of GPIO bank 5 bits Reading it returns the output drive state" range="31 - 16" rwaccess="R/W1TS"/> 
		<bitfield id="SET4" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 sets the output drive state of GPIO bank 4 bits Reading it returns the output drive state" range="15 - 0" rwaccess="R/W1TS"/>
	</register>
	<register id="MEM_CLR_DATA45" acronym="MEM_CLR_DATA45" offset="0x6C" width="32" description="Clear Output Drive State Register">
		<bitfield id="CLR5" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 clears the output drive state of GPIO Reading it returns the output drive state" range="31 - 16" rwaccess="R/W1TC"/> 
		<bitfield id="CLR4" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 clears the output drive state of GPIO Reading it returns the output drive state" range="15 - 0" rwaccess="R/W1TC"/>
	</register>
	<register id="MEM_IN_DATA45" acronym="MEM_IN_DATA45" offset="0x70" width="32" description="Bank Status Register">
		<bitfield id="IN5" width="16" begin="31" end="16" resetval="0x0" description="Status of GPIO bank 5 bits" range="31 - 16" rwaccess="R"/> 
		<bitfield id="IN4" width="16" begin="15" end="0" resetval="0x0" description="Status of GPIO bank 4 bits" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="MEM_SET_RIS_TRIG45" acronym="MEM_SET_RIS_TRIG45" offset="0x74" width="32" description="Set Rising Edge Detection Register">
		<bitfield id="SETRIS5" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 enables rising edge detection for GPIO bank 5 bits" range="31 - 16" rwaccess="R/W1TS"/> 
		<bitfield id="SETRIS4" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 enables rising edge detection for GPIO bank 4 bits" range="15 - 0" rwaccess="R/W1TS"/>
	</register>
