ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/am243x/GPIO1.xml
	<register id="MEM_CLR_RIS_TRIG45" acronym="MEM_CLR_RIS_TRIG45" offset="0x78" width="32" description="Clear Rising Edge Detection Register">
		<bitfield id="CLRRIS5" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 clears rising edge detection for GPIO bank 5 bits" range="31 - 16" rwaccess="R/W1TC"/> 
		<bitfield id="CLRRIS4" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 clears rising edge detection for GPIO bank 4 bits" range="15 - 0" rwaccess="R/W1TC"/>
	</register>
	<register id="MEM_SET_FAL_TRIG45" acronym="MEM_SET_FAL_TRIG45" offset="0x7C" width="32" description="Set Falling Edge Detection Register">
		<bitfield id="SETFAL5" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 enables falling edge detection for for GPIO bank 5 bits " range="31 - 16" rwaccess="R/W1TS"/> 
		<bitfield id="SETFAL4" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 enables falling edge detection for for GPIO bank 4 bits " range="15 - 0" rwaccess="R/W1TS"/>
	</register>
	<register id="MEM_CLR_FAL_TRIG45" acronym="MEM_CLR_FAL_TRIG45" offset="0x80" width="32" description="Clear Falling Edge Detection Register">
		<bitfield id="CLRFAL5" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 clears falling edge detection for for GPIO bank 5 bits " range="31 - 16" rwaccess="R/W1TC"/> 
		<bitfield id="CLRFAL4" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 clears falling edge detection for for GPIO bank 4 bits " range="15 - 0" rwaccess="R/W1TC"/>
	</register>
	<register id="MEM_INTSTAT45" acronym="MEM_INTSTAT45" offset="0x84" width="32" description="Bank Interrupt Status Register">
		<bitfield id="STAT5" width="16" begin="31" end="16" resetval="0x0" description="Status of GPIO bank 4 bits interrupt Reading back 1 = interrupt occurred 0 = interrupt hasnt occurred since last cleared Writing 1 clears the corresponding interrupt status" range="31 - 16" rwaccess="R/W1TC"/> 
		<bitfield id="STAT4" width="16" begin="15" end="0" resetval="0x0" description="Status of GPIO bank 4 bits interrupt Reading back 1 = interrupt occurred 0 = interrupt hasnt occurred since last cleared Writing 1 clears the corresponding interrupt status" range="15 - 0" rwaccess="R/W1TC"/>
	</register>
	<register id="MEM_DIR67" acronym="MEM_DIR67" offset="0x88" width="32" description="Direction Register">
		<bitfield id="DIR7" width="16" begin="31" end="16" resetval="0x65535" description="Direction of GPIO bank 7 bits, 0 = output, 1 = input" range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="DIR6" width="16" begin="15" end="0" resetval="0x65535" description="Direction of GPIO bank 6 bits, 0 = output, 1 = input" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="MEM_OUT_DATA67" acronym="MEM_OUT_DATA67" offset="0x8C" width="32" description="Output Drive State Register">
		<bitfield id="OUT7" width="16" begin="31" end="16" resetval="0x0" description="Output drive state of GPIO bank 7 bits, does not affect operation when it is configured as input Reading it returns the output drive state" range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="OUT6" width="16" begin="15" end="0" resetval="0x0" description="Output drive state of GPIO bank 6 bits, does not affect operation when it is configured as input Reading it returns the output drive state" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="MEM_SET_DATA67" acronym="MEM_SET_DATA67" offset="0x90" width="32" description="Set Output Drive State Register">
		<bitfield id="SET7" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 sets the output drive state of GPIO bank 7 bits Reading it returns the output drive state" range="31 - 16" rwaccess="R/W1TS"/> 
		<bitfield id="SET6" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 sets the output drive state of GPIO bank 6 bits Reading it returns the output drive state" range="15 - 0" rwaccess="R/W1TS"/>
	</register>
	<register id="MEM_CLR_DATA67" acronym="MEM_CLR_DATA67" offset="0x94" width="32" description="Clear Output Drive State Register">
		<bitfield id="CLR7" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 clears the output drive state of GPIO Reading it returns the output drive state" range="31 - 16" rwaccess="R/W1TC"/> 
		<bitfield id="CLR6" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 clears the output drive state of GPIO Reading it returns the output drive state" range="15 - 0" rwaccess="R/W1TC"/>
	</register>
	<register id="MEM_IN_DATA67" acronym="MEM_IN_DATA67" offset="0x98" width="32" description="Bank Status Register">
		<bitfield id="IN7" width="16" begin="31" end="16" resetval="0x0" description="Status of GPIO bank 7 bits" range="31 - 16" rwaccess="R"/> 
		<bitfield id="IN6" width="16" begin="15" end="0" resetval="0x0" description="Status of GPIO bank 6 bits" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="MEM_SET_RIS_TRIG67" acronym="MEM_SET_RIS_TRIG67" offset="0x9C" width="32" description="Set Rising Edge Detection Register">
		<bitfield id="SETRIS7" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 enables rising edge detection for GPIO bank 7 bits" range="31 - 16" rwaccess="R/W1TS"/> 
		<bitfield id="SETRIS6" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 enables rising edge detection for GPIO bank 6 bits" range="15 - 0" rwaccess="R/W1TS"/>
	</register>
	<register id="MEM_CLR_RIS_TRIG67" acronym="MEM_CLR_RIS_TRIG67" offset="0xA0" width="32" description="Clear Rising Edge Detection Register">
		<bitfield id="CLRRIS7" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 clears rising edge detection for GPIO bank 7 bits" range="31 - 16" rwaccess="R/W1TC"/> 
		<bitfield id="CLRRIS6" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 clears rising edge detection for GPIO bank 6 bits" range="15 - 0" rwaccess="R/W1TC"/>
	</register>
	<register id="MEM_SET_FAL_TRIG67" acronym="MEM_SET_FAL_TRIG67" offset="0xA4" width="32" description="Set Falling Edge Detection Register">
		<bitfield id="SETFAL7" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 enables falling edge detection for for GPIO bank 7 bits " range="31 - 16" rwaccess="R/W1TS"/> 
		<bitfield id="SETFAL6" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 enables falling edge detection for for GPIO bank 6 bits " range="15 - 0" rwaccess="R/W1TS"/>
	</register>
	<register id="MEM_CLR_FAL_TRIG67" acronym="MEM_CLR_FAL_TRIG67" offset="0xA8" width="32" description="Clear Falling Edge Detection Register">
		<bitfield id="CLRFAL7" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 clears falling edge detection for for GPIO bank 7 bits " range="31 - 16" rwaccess="R/W1TC"/> 
		<bitfield id="CLRFAL6" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 clears falling edge detection for for GPIO bank 6 bits " range="15 - 0" rwaccess="R/W1TC"/>
	</register>
	<register id="MEM_INTSTAT67" acronym="MEM_INTSTAT67" offset="0xAC" width="32" description="Bank Interrupt Status Register">
		<bitfield id="STAT7" width="16" begin="31" end="16" resetval="0x0" description="Status of GPIO bank 6 bits interrupt Reading back 1 = interrupt occurred 0 = interrupt hasnt occurred since last cleared Writing 1 clears the corresponding interrupt status" range="31 - 16" rwaccess="R/W1TC"/> 
		<bitfield id="STAT6" width="16" begin="15" end="0" resetval="0x0" description="Status of GPIO bank 6 bits interrupt Reading back 1 = interrupt occurred 0 = interrupt hasnt occurred since last cleared Writing 1 clears the corresponding interrupt status" range="15 - 0" rwaccess="R/W1TC"/>
	</register>
	<register id="MEM_DIR8" acronym="MEM_DIR8" offset="0xB0" width="32" description="Direction Register">
		<bitfield id="DIR8" width="16" begin="15" end="0" resetval="0x65535" description="Direction of GPIO bank 8 bits, 0 = output, 1 = input" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="MEM_OUT_DATA8" acronym="MEM_OUT_DATA8" offset="0xB4" width="32" description="Output Drive State Register">
		<bitfield id="OUT8" width="16" begin="15" end="0" resetval="0x0" description="Output drive state of GPIO bank 8 bits, does not affect operation when it is configured as input Reading it returns the output drive state" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="MEM_SET_DATA8" acronym="MEM_SET_DATA8" offset="0xB8" width="32" description="Set Output Drive State Register">
		<bitfield id="SET8" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 sets the output drive state of GPIO bank 8 bits Reading it returns the output drive state" range="15 - 0" rwaccess="R/W1TS"/>
	</register>
	<register id="MEM_CLR_DATA8" acronym="MEM_CLR_DATA8" offset="0xBC" width="32" description="Clear Output Drive State Register">
		<bitfield id="CLR8" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 clears the output drive state of GPIO Reading it returns the output drive state" range="15 - 0" rwaccess="R/W1TC"/>
	</register>
	<register id="MEM_IN_DATA8" acronym="MEM_IN_DATA8" offset="0xC0" width="32" description="Bank Status Register">
		<bitfield id="IN8" width="16" begin="15" end="0" resetval="0x0" description="Status of GPIO bank 8 bits" range="15 - 0" rwaccess="R"/>
	</register>
