ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/am243x/GPIO1.xml
	<register id="MEM_SET_RIS_TRIG8" acronym="MEM_SET_RIS_TRIG8" offset="0xC4" width="32" description="Set Rising Edge Detection Register">
		<bitfield id="SETRIS8" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 enables rising edge detection for GPIO bank 8 bits" range="15 - 0" rwaccess="R/W1TS"/>
	</register>
	<register id="MEM_CLR_RIS_TRIG8" acronym="MEM_CLR_RIS_TRIG8" offset="0xC8" width="32" description="Clear Rising Edge Detection Register">
		<bitfield id="CLRRIS8" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 clears rising edge detection for GPIO bank 8 bits" range="15 - 0" rwaccess="R/W1TC"/>
	</register>
	<register id="MEM_SET_FAL_TRIG8" acronym="MEM_SET_FAL_TRIG8" offset="0xCC" width="32" description="Set Falling Edge Detection Register">
		<bitfield id="SETFAL8" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 enables falling edge detection for for GPIO bank 8 bits " range="15 - 0" rwaccess="R/W1TS"/>
	</register>
	<register id="MEM_CLR_FAL_TRIG8" acronym="MEM_CLR_FAL_TRIG8" offset="0xD0" width="32" description="Clear Falling Edge Detection Register">
		<bitfield id="CLRFAL8" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 clears falling edge detection for for GPIO bank 8 bits " range="15 - 0" rwaccess="R/W1TC"/>
	</register>
	<register id="MEM_INTSTAT8" acronym="MEM_INTSTAT8" offset="0xD4" width="32" description="Bank Interrupt Status Register">
		<bitfield id="STAT8" width="16" begin="15" end="0" resetval="0x0" description="Status of GPIO bank 8 bits interrupt Reading back 1 = interrupt occurred 0 = interrupt hasnt occurred since last cleared Writing 1 clears the corresponding interrupt status" range="15 - 0" rwaccess="R/W1TC"/>
	</register>
</module>